<a href="https://colab.research.google.com/github/mekala89/Assisnment-1/blob/master/pandaseg.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import files
uploaded = files.upload()

import pandas as pd

Saving Titanic_Data.csv to Titanic_Data.csv

In [0]:
import io
df2 = pd.read_csv(io.BytesIO(uploaded['Titanic_Data.csv']))

In [4]:
print(df2)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [6]:
print(df2.head(5))

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
df2.tail(5)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [9]:
df2.shape

(891, 12)

In [12]:
# destsil about the dataset
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
df2['Survived'].unique()

array([0, 1])

In [14]:
df2['Survived'].nunique()

2

In [16]:
df2['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [0]:
df4 = pd.read_csv('https://raw.githubusercontent.com/datasets/covid-19/master/data/countries-aggregated.csv')

In [18]:
df4

             Date             Country  Confirmed  Recovered  Deaths
0      2020-01-22         Afghanistan          0          0       0
1      2020-01-22             Albania          0          0       0
2      2020-01-22             Algeria          0          0       0
3      2020-01-22             Andorra          0          0       0
4      2020-01-22              Angola          0          0       0
...           ...                 ...        ...        ...     ...
22555  2020-05-20  West Bank and Gaza        398        346       2
22556  2020-05-20      Western Sahara          6          6       0
22557  2020-05-20               Yemen        184          5      30
22558  2020-05-20              Zambia        832        197       7
22559  2020-05-20            Zimbabwe         48         18       4

[22560 rows x 5 columns]

In [19]:
#loc[] accessing rows and columns of dataframe in series format
df2.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [20]:
df2.loc[890]

PassengerId                    891
Survived                         0
Pclass                           3
Name           Dooley, Mr. Patrick
Sex                           male
Age                             32
SibSp                            0
Parch                            0
Ticket                      370376
Fare                          7.75
Cabin                          NaN
Embarked                         Q
Name: 890, dtype: object

In [21]:
#to  change in data frmae format
df2.loc[[890]]

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
890          891         0       3  ...  7.75   NaN         Q

[1 rows x 12 columns]

In [23]:
# to certain rows eg 1 to 100
df2.loc[[1,100]]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
100          101         0       3  ...   7.8958   NaN         S

[2 rows x 12 columns]

In [24]:
df2.loc[1:100]
#1 to 100 (n)

     PassengerId  Survived  Pclass  ...     Fare    Cabin  Embarked
1              2         1       1  ...  71.2833      C85         C
2              3         1       3  ...   7.9250      NaN         S
3              4         1       1  ...  53.1000     C123         S
4              5         0       3  ...   8.0500      NaN         S
5              6         0       3  ...   8.4583      NaN         Q
..           ...       ...     ...  ...      ...      ...       ...
96            97         0       1  ...  34.6542       A5         C
97            98         1       1  ...  63.3583  D10 D12         C
98            99         1       2  ...  23.0000      NaN         S
99           100         0       2  ...  26.0000      NaN         S
100          101         0       3  ...   7.8958      NaN         S

[100 rows x 12 columns]

In [29]:
df2.loc[1:5,['Sex','Age']]

      Sex   Age
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0
5    male   NaN

In [31]:
#integer based location method 0to 2(n-1)
df2.iloc[0:3]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [33]:
df2.iloc[1:100,-1]

1     C
2     S
3     S
4     S
5     Q
     ..
95    S
96    C
97    C
98    S
99    S
Name: Embarked, Length: 99, dtype: object

In [34]:
df2.iloc[1:100,-5:]

    Parch            Ticket     Fare    Cabin Embarked
1       0          PC 17599  71.2833      C85        C
2       0  STON/O2. 3101282   7.9250      NaN        S
3       0            113803  53.1000     C123        S
4       0            373450   8.0500      NaN        S
5       0            330877   8.4583      NaN        Q
..    ...               ...      ...      ...      ...
95      0            374910   8.0500      NaN        S
96      0          PC 17754  34.6542       A5        C
97      1          PC 17759  63.3583  D10 D12        C
98      1            231919  23.0000      NaN        S
99      0            244367  26.0000      NaN        S

[99 rows x 5 columns]

In [35]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [36]:
df2.isnull()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [37]:
df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [45]:
df2.isnull().sum().sort_values(ascending=False)

Age            177
Embarked         2
Fare             0
Ticket           0
Parch            0
SibSp            0
Sex              0
Name             0
Pclass           0
Survived         0
PassengerId      0
dtype: int64

In [0]:
df3=df2.drop(['Cabin'],axis=1)

In [41]:
df2.drop(['Cabin'],axis=1,inplace=True)
print(df2.head(5))

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

In [43]:
df2['Age'].median()

28.0

In [0]:
import numpy as np
df2['Age'].replace(np.nan,df2['Age'].median(),inplace=True)

In [48]:
df2.isnull().sum().sort_values(ascending=False)

Embarked       2
Fare           0
Ticket         0
Parch          0
SibSp          0
Age            0
Sex            0
Name           0
Pclass         0
Survived       0
PassengerId    0
dtype: int64

In [49]:
print(df2.head())

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

In [0]:
df2.dropna(inplace=True)

In [53]:
df2.shape

(889, 11)

In [54]:
df2['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 889, dtype: object

In [0]:
def trans(x):
  if x=='male':
    return 1
  else:
    return 0

In [56]:
df2['Sex']=df2['Sex'].apply(trans)
print(df2['Sex'])

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 889, dtype: int64

In [62]:
## interpolation
import numpy as np
df=pd.DataFrame({'A':[10,20,np.nan,30,np.nan],'B':[np.nan,100,200,300,np.nan],'C':[100,200,300,np.nan,np.nan],'D':[20,30,40,np.nan,np.nan]})
df

      A      B      C     D
0  10.0    NaN  100.0  20.0
1  20.0  100.0  200.0  30.0
2   NaN  200.0  300.0  40.0
3  30.0  300.0    NaN   NaN
4   NaN    NaN    NaN   NaN

In [63]:
df.interpolate(method='linear',limit_direction='backward')

      A      B      C     D
0  10.0  100.0  100.0  20.0
1  20.0  100.0  200.0  30.0
2  25.0  200.0  300.0  40.0
3  30.0  300.0    NaN   NaN
4   NaN    NaN    NaN   NaN

In [65]:
df.interpolate(method='linear',limit_direction='forward')

      A      B      C     D
0  10.0    NaN  100.0  20.0
1  20.0  100.0  200.0  30.0
2  25.0  200.0  300.0  40.0
3  30.0  300.0  300.0  40.0
4  30.0  300.0  300.0  40.0

In [99]:
from google.colab import files
uploaded = files.upload()

import pandas as pd

In [100]:
import io
dff = pd.read_csv(io.BytesIO(uploaded['diabetes.csv']))
# for scaling operations

KeyError: ignored

In [101]:
dff.shape

(768, 9)

In [102]:
dff.head(5)

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

In [103]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [0]:
from  sklearn.preprocessing import MinMaxScaler

In [0]:
array=dff.values
X=array[:,0:8]
Y=array[:,8]
scaler=MinMaxScaler(feature_range=(0, 1))
dia_df_array=scaler.fit_transform(X)

In [0]:
names=['Preg','Glu','BP','SkinThic','Insu','BMI','DPF','AGe']

In [96]:
dffi=pd.DataFrame(dia_df_array,columns=names)
print(dffi)

         Preg       Glu        BP  ...       BMI       DPF       AGe
0    0.352941  0.743719  0.590164  ...  0.500745  0.234415  0.483333
1    0.058824  0.427136  0.540984  ...  0.396423  0.116567  0.166667
2    0.470588  0.919598  0.524590  ...  0.347243  0.253629  0.183333
3    0.058824  0.447236  0.540984  ...  0.418778  0.038002  0.000000
4    0.000000  0.688442  0.327869  ...  0.642325  0.943638  0.200000
..        ...       ...       ...  ...       ...       ...       ...
763  0.588235  0.507538  0.622951  ...  0.490313  0.039710  0.700000
764  0.117647  0.613065  0.573770  ...  0.548435  0.111870  0.100000
765  0.294118  0.608040  0.590164  ...  0.390462  0.071307  0.150000
766  0.058824  0.633166  0.491803  ...  0.448584  0.115713  0.433333
767  0.058824  0.467337  0.573770  ...  0.453055  0.101196  0.033333

[768 rows x 8 columns]

In [112]:
from  sklearn.preprocessing import StandardScaler
array=dff.values
X=array[:,0:8]
print(X.shape)
Y=array[:,8]
print(Y.shape)

(768, 8)
(768,)

In [0]:
sc=StandardScaler()
dss=sc.fit_transform(X)
names=['Preg','Glu','BP','SkinThic','Insu','BMI','DPF','AGe']
ffi=pd.DataFrame(dss,columns=names)

In [107]:
print(ffi)
ffi.shape

         Preg       Glu        BP  ...       BMI       DPF       AGe
0    0.639947  0.848324  0.149641  ...  0.204013  0.468492  1.425995
1   -0.844885 -1.123396 -0.160546  ... -0.684422 -0.365061 -0.190672
2    1.233880  1.943724 -0.263941  ... -1.103255  0.604397 -0.105584
3   -0.844885 -0.998208 -0.160546  ... -0.494043 -0.920763 -1.041549
4   -1.141852  0.504055 -1.504687  ...  1.409746  5.484909 -0.020496
..        ...       ...       ...  ...       ...       ...       ...
763  1.827813 -0.622642  0.356432  ...  0.115169 -0.908682  2.532136
764 -0.547919  0.034598  0.046245  ...  0.610154 -0.398282 -0.531023
765  0.342981  0.003301  0.149641  ... -0.735190 -0.685193 -0.275760
766 -0.844885  0.159787 -0.470732  ... -0.240205 -0.371101  1.170732
767 -0.844885 -0.873019  0.046245  ... -0.202129 -0.473785 -0.871374

[768 rows x 8 columns]

(768, 8)